posts/query-optimizer-in-database/index.org
#+BEGIN_COMMENT
.. title: Query Optimizer in Database
.. slug: query-optimizer-in-database
.. date: 2017-05-17 17:35:26 UTC+08:00
.. tags: database, query optimizer, mathjax
.. category: database
.. link: 
.. description: 
.. type: text
#+END_COMMENT


* 近况

最近在上CS186, 数据库系统。 这么课挺棒的，课程的project是实现一个单机数据库，一共分为四个project，分别为:

    1. 实现schema设计
    2. 实现BPlusTree
    3. 实现join操作符
    4. 实现query optimizer

#+HTML: <!--TEASER_END-->

#+HTML: <iframe src="http://www.xmind.net/embed/qwRx" width="900px" height="540px"></iframe>


目前课件基本看完了，project1和2已经完成。做下来感觉课程难度适中，project难度其实也还好，毕竟没有并发、事务等功能，所以之后应该还会去学习一下华盛顿大学的cs444吧，那门课的project采用的是SimpleDB, 微微看了下课程计划，有数据库事务和并行数据库这块的内容，应该还是比较好的吧。但是6.824这门课的级别应该来说更高些。分布式一致性这块确实需要认真学学，很有必要。

接下来准备写个系列来记录最近学习数据库的成果，查漏补缺，夯实基础。

* Query Optimizer

* Recovery Manager

这个部分是为了保证数据库一致性、事务原子性以及即使发生错误时的持久性。

** 错误分类
常见的错误包括:

1. 事务错误
2. 系统错误
3. 存储媒介错误(这种错误Recovery Manager无法处理， 只能通过冗余、检查来避免, 退回到某个存档版本)

** 为什么需要它
