posts/query-optimizer-in-database/index.html
<!DOCTYPE html>
<html lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="author" content="Abner Zheng">
<title>Query Optimizer in Database | Abner Zheng's Blog</title>
<link href="../../assets/css/all.css" rel="stylesheet" type="text/css">
<!--[if lt IE 9]>
    <![endif]--><link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
</head>
<body>
    <div id="wrp">
        <div id="cont">
            <div id="page">
                <header><h1>
                        <a href="https://abnerzheng.github.io/" title="Abner Zheng's Blog" rel="home">Abner Zheng's Blog</a>
                    </h1>
                </header><div id="body">
                    <nav><ul>
<li><a href="https://abnerzheng.github.io/" title="Home" rel="home"><i class="fa fa-fw fa-home"></i></a></li>
                            <li><a href="https://abnerzheng.github.io/categories/" title="Tags"><i class="fa fa-fw fa-tags"></i></a></li>
                            <li><a href="https://abnerzheng.github.io/rss.xml" title="RSS feed"><i class="fa fa-fw fa-rss"></i></a></li>
                            <li><a href="https://abnerzheng.github.io/pages/about" title="About"><i class="fa fa-fw fa-user"></i></a></li>
                            <li><a href="https://github.com/abnerzheng" title="My GitHub repo"><i class="fa fa-fw fa-github"></i></a></li>
                        </ul></nav><div id="content">
    <article class="post-text"><div class="h-entry" itemscope="itemscope" itemtype="http://schema.org/Article">
        <h1 class="p-name" itemprop="headline name">Query Optimizer in Database</h1>

    <small>
        Posted: <time class="published dt-published" datetime="2017-05-17T17:35:26+08:00" itemprop="datePublished">2017-05-17 17:35</time>
		          |  More posts about
            <a class="tag" href="../../categories/database/"><span class="badge badge-info">database</span></a>
            <a class="tag" href="../../categories/mathjax/"><span class="badge badge-info">mathjax</span></a>
            <a class="tag" href="../../categories/query-optimizer/"><span class="badge badge-info">query optimizer</span></a>

    </small>
    <div class="e-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">近况</h2>
<div class="outline-text-2" id="text-1">
<p>
最近在上CS186, 数据库系统。 这么课挺棒的，课程的project是实现一个单机数据库，一共分为四个project，分别为:
</p>

<ol class="org-ol">
<li>实现schema设计
</li>
<li>实现BPlusTree
</li>
<li>实现join操作符
</li>
<li>实现query optimizer
</li>
</ol>
<!--TEASER_END--><iframe src="http://www.xmind.net/embed/qwRx" width="900px" height="540px"></iframe>


<p>
目前课件基本看完了，project1和2已经完成。做下来感觉课程难度适中，project难度其实也还好，毕竟没有并发、事务等功能，所以之后应该还会去学习一下华盛顿大学的cs444吧，那门课的project采用的是SimpleDB, 微微看了下课程计划，有数据库事务和并行数据库这块的内容，应该还是比较好的吧。但是6.824这门课的级别应该来说更高些。分布式一致性这块确实需要认真学学，很有必要。
</p>

<p>
接下来准备写个系列来记录最近学习数据库的成果，查漏补缺，夯实基础。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Query Optimizer</h2>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Recovery Manager</h2>
<div class="outline-text-2" id="text-3">
<p>
这个部分是为了保证数据库一致性、事务原子性以及即使发生错误时的持久性。
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">错误分类</h3>
<div class="outline-text-3" id="text-3-1">
<p>
常见的错误包括:
</p>

<ol class="org-ol">
<li>事务错误
</li>
<li>系统错误
</li>
<li>存储媒介错误(这种错误Recovery Manager无法处理， 只能通过冗余、检查来避免, 退回到某个存档版本)
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">为什么需要它</h3>
</div>
</div>
    </div>
    </div>
            <ul class="pager">
<li class="previous">
                <a href="../shu-ju-ku-guan-li-xi-tong-yuan-li-yu-she-ji-ke-hou-ti/" rel="prev">← 前一篇</a>
            </li>
            <li class="next">
                <a href="../ru-he-zheng-ming-you-2he-5zu-cheng-de-ying-bi-ke-yi-huan-chu-ren-yi-da-yu-3de-zheng-shu-ying-bi/" rel="next">后一篇 →</a>
            </li>
        </ul>
<script type="text/javascript" async src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.0/MathJax.js?config=TeX-MML-AM_CHTML">
      </script></article>
</div>
                </div>
                <div id="ftr">
                </div>
            </div>
        </div>
    </div>
	<footer><small>Contents © 2017         <a href="mailto:abnerzheng@gmail.com">Abner Zheng</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </small>
	</footer>
</body>
</html>
